<h2 style="color:tomato">EDA on Road Accidents in India

In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("accident.csv")

In [5]:
df.head(3)

        State/UT  Year     Mode  Total
0  A & N Islands  2001  Bicycle      0
1  A & N Islands  2001      Bus      2
2  A & N Islands  2001      Car      1

In [14]:
df.rename(columns={'states':'States'},inplace=True)

In [15]:
df.head(3)

          States  Year     Mode  Total
0  A & N Islands  2001  Bicycle      0
1  A & N Islands  2001      Bus      2
2  A & N Islands  2001      Car      1

In [20]:
states = df.groupby(by='States').sum()

In [41]:
df['Year'].unique()

array([2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011,
       2012, 2013, 2014], dtype=int64)

In [43]:
df['Mode'].unique()

array(['Bicycle', 'Bus', 'Car', 'Jeep', 'Other Motor Vehicles', 'Others',
       'Pedestrian', 'Three Wheeler', 'Truck/Lorry', 'Two Wheeler'],
      dtype=object)

<h3>1.Which state had maximum number of Accidents?

In [53]:
max_acc_state = states[states['Total'] == states['Total'].max()].index[0]
max_acc_state_num = states[states['Total'] == states['Total'].max()]['Total'][0]
print(max_acc_state,"has maximum number of accidents i.e.,",max_acc_state_num)

Tamil Nadu has maximum number of accidents i.e., 179587

<h3>2.Which state had minimum number of Accidents?

In [45]:
min_acc_state = states[states['Total'] == states['Total'].min()].index[0]
min_acc_state_num = states[states['Total'] == states['Total'].min()]['Total'][0]
print(min_acc_state,"has minimum number of accidents i.e.,",min_acc_state_num)

Lakshadweep has minimum number of accidents i.e., 5

In [47]:
year = df.groupby(by='Year').sum()
year

       Total
Year
2001   80262
2002   84059
2003   84430
2004   91376
2005   98254
2006  105725
2007  114590
2008  118239
2009  126896
2010  133938
2011  136834
2012  139091
2013  137423
2014  141526

<h3>3.Which year had maximum number of Accidents?

In [56]:
max_acc_year = year[year['Total'] == year['Total'].max()].index[0]
max_acc_year_num = year[year['Total'] == year['Total'].max()]['Total'].values[0]
# max_acc_year_num
print(max_acc_year,"has maximum number of accidents i.e.,",max_acc_year_num)

2014 has maximum number of accidents i.e., 141526

<h3>4.Which year had minimum number of Accidents?

In [57]:
min_acc_year = year[year['Total'] == year['Total'].min()].index[0]
min_acc_year_num = year[year['Total'] == year['Total'].min()]['Total'].values[0]
# max_acc_year_num
print(min_acc_year,"has minimum number of accidents i.e.,",min_acc_year_num)

2001 has minimum number of accidents i.e., 80262

In [59]:
mode = df.groupby(by='Mode').sum()
mode

                        Year   Total
Mode
Bicycle               985689   38786
Bus                   985689  171137
Car                   985689  147871
Jeep                  985689  123836
Other Motor Vehicles  985689   98057
Others                985689  136774
Pedestrian            985689  134341
Three Wheeler         985689   79862
Truck/Lorry           985689  344443
Two Wheeler           985689  317536

<h3>5.Which mode had maximum number of Accidents?

In [60]:
max_acc_mode = mode[mode['Total'] == mode['Total'].max()].index[0]
max_acc_mode_num = mode[mode['Total'] == mode['Total'].max()]['Total'].values[0]
# max_acc_year_num
print(max_acc_mode,"has maximum number of accidents i.e.,",max_acc_mode_num)

Truck/Lorry has maximum number of accidents i.e., 344443

<h3>6.Which mode had minimum number of Accidents?

In [62]:
min_acc_mode = mode[mode['Total'] == mode['Total'].min()].index[0]
min_acc_mode_num = mode[mode['Total'] == mode['Total'].min()]['Total'].values[0]
# max_acc_year_num
print(min_acc_mode,"has minimum number of accidents i.e.,",min_acc_mode_num)

Bicycle has minimum number of accidents i.e., 38786

<h3>7. Find total number of accidents took place in India from 2001 to 2014

In [66]:
total_accident = df['Total'].sum()
print('About',total_accident,'accidents had occurs from 2001 to 2014')

About 1592643 accidents had occurs from 2001 to 2014

<h3>8. Find average number accidents took place per year?

In [76]:
average_acc_per_year = df['Total'].sum()/df['Year'].nunique()
print('On average',round(average_acc_per_year),'accidents took place per year')

On average 113760 accidents took place per year

<h3>9.Which year is good for two wheelers in number of accidents?

In [97]:
two_wheeler = df[df['Mode'] == 'Two Wheeler']
year_2_wheeler = two_wheeler.groupby(by='Year').sum()
good_year_2_wheeler = year_2_wheeler[year_2_wheeler['Total'] == year_2_wheeler['Total'].min()]['Total'].index[0]
good_year_2_wheeler_num = year_2_wheeler[year_2_wheeler['Total'] == year_2_wheeler['Total'].min()]['Total'].values[0]
print(good_year_2_wheeler,'had witness least  number of accident for two wheelers i.e,',good_year_2_wheeler_num)

2001 had witness least  number of accident for two wheelers i.e, 9638

<h3>10. Which state has less accident in 2014?

In [122]:
acc_2014 = df[df['Year'] == 2014]
states_wise_2014 = acc_2014.groupby(by='States').sum()
state_min_acc_2014 = states_wise_2014[states_wise_2014['Total'] == states_wise_2014['Total'].min()].index[0]
state_min_acc = states_wise_2014[states_wise_2014['Total'] == states_wise_2014['Total'].min()]['Total'].values[0]
print(state_min_acc_2014,'had witness no accidents in 2014 i.e.,',state_min_acc)

Lakshadweep had witness no accidents in 2014 i.e., 0